terraform apply
```
terraform apply
2020/12/07 19:27:06 [WARN] Log levels other than TRACE are currently unreliable, and are supported only for backward compatibility.
  Use TF_LOG=TRACE to see Terraform's internal logs.
  ----
tencentcloud_security_group.foo: Refreshing state... [id=sg-6l84uld5]
tencentcloud_protocol_template.templateB: Refreshing state... [id=ppm-iqt4ksyi]
tencentcloud_protocol_template_group.group: Refreshing state... [id=ppmg-bmdguwfw]
tencentcloud_security_group_rule.protocol_template_group: Refreshing state... [id=eyJzZ19pZCI6InNnLTZsODR1bGQ1IiwicG9saWN5X3R5cGUiOiJpbmdyZXNzIiwiY2lkcl9pcCI6IjAuMC4wLjAvMCIsInByb3RvY29sIjoiQUxMIiwicG9ydF9yYW5nZSI6IkFMTCIsImFjdGlvbiI6IkRST1AiLCJzb3VyY2Vfc2dfaWQiOiIiLCJkZXNjcmlwdGlvbiI6IiIsInByb3RvY29sX3RlbXBsYXRlX2lkIjoiIiwicHJvdG9jb2xfdGVtcGxhdGVfZ3JvdXBfaWQiOiJwcG1nLWJtZGd1d2Z3In0=]
tencentcloud_security_group_rule.protocol_template: Refreshing state... [id=eyJzZ19pZCI6InNnLTZsODR1bGQ1IiwicG9saWN5X3R5cGUiOiJJTkdSRVNTIiwiY2lkcl9pcCI6IjAuMC4wLjAvMCIsInByb3RvY29sIjoiQUxMIiwicG9ydF9yYW5nZSI6IkFMTCIsImFjdGlvbiI6IkRST1AiLCJzb3VyY2Vfc2dfaWQiOiIiLCJkZXNjcmlwdGlvbiI6IiIsInByb3RvY29sX3RlbXBsYXRlX2lkIjoicHBtLWlxdDRrc3lpIiwicHJvdG9jb2xfdGVtcGxhdGVfZ3JvdXBfaWQiOiIifQ==]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # tencentcloud_address_template.templateB will be created
  + resource "tencentcloud_address_template" "templateB" {
      + addresses = [
          + "1.1.1.0-1.1.1.1",
          + "1.1.1.1/24",
        ]
      + id        = (known after apply)
      + name      = "testB"
    }

  # tencentcloud_address_template_group.group will be created
  + resource "tencentcloud_address_template_group" "group" {
      + id           = (known after apply)
      + name         = "test_update"
      + template_ids = (known after apply)
    }

  # tencentcloud_security_group_rule.address_template will be created
  + resource "tencentcloud_security_group_rule" "address_template" {
      + description       = (known after apply)
      + id                = (known after apply)
      + ip_protocol       = (known after apply)
      + policy            = "DROP"
      + port_range        = (known after apply)
      + security_group_id = "sg-6l84uld5"
      + source_sgid       = (known after apply)
      + type              = "INGRESS"

      + address_template {
          + template_id = (known after apply)
        }

      + protocol_template {
          + group_id    = (known after apply)
          + template_id = (known after apply)
        }
    }

  # tencentcloud_security_group_rule.address_template_group will be created
  + resource "tencentcloud_security_group_rule" "address_template_group" {
      + description       = (known after apply)
      + id                = (known after apply)
      + ip_protocol       = (known after apply)
      + policy            = "DROP"
      + port_range        = (known after apply)
      + security_group_id = "sg-6l84uld5"
      + source_sgid       = (known after apply)
      + type              = "ingress"

      + address_template {
          + group_id = (known after apply)
        }

      + protocol_template {
          + group_id    = (known after apply)
          + template_id = (known after apply)
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

tencentcloud_address_template.templateB: Creating...
tencentcloud_address_template.templateB: Creation complete after 1s [id=ipm-27p5xxzw]
tencentcloud_address_template_group.group: Creating...
tencentcloud_security_group_rule.address_template: Creating...
tencentcloud_address_template_group.group: Creation complete after 0s [id=ipmg-li7cjc1m]
tencentcloud_security_group_rule.address_template_group: Creating...
tencentcloud_security_group_rule.address_template: Creation complete after 0s [id=eyJzZ19pZCI6InNnLTZsODR1bGQ1IiwicG9saWN5X3R5cGUiOiJJTkdSRVNTIiwiY2lkcl9pcCI6IiIsInByb3RvY29sIjoiQUxMIiwicG9ydF9yYW5nZSI6IkFMTCIsImFjdGlvbiI6IkRST1AiLCJzb3VyY2Vfc2dfaWQiOiIiLCJkZXNjcmlwdGlvbiI6IiIsImFkZHJlc3NfdGVtcGxhdGVfaWQiOiJpcG0tMjdwNXh4enciLCJhZGRyZXNzX3RlbXBsYXRlX2dyb3VwX2lkIjoiIn0=]
tencentcloud_security_group_rule.address_template_group: Creation complete after 0s [id=eyJzZ19pZCI6InNnLTZsODR1bGQ1IiwicG9saWN5X3R5cGUiOiJpbmdyZXNzIiwiY2lkcl9pcCI6IiIsInByb3RvY29sIjoiQUxMIiwicG9ydF9yYW5nZSI6IkFMTCIsImFjdGlvbiI6IkRST1AiLCJzb3VyY2Vfc2dfaWQiOiIiLCJkZXNjcmlwdGlvbiI6IiIsImFkZHJlc3NfdGVtcGxhdGVfaWQiOiIiLCJhZGRyZXNzX3RlbXBsYXRlX2dyb3VwX2lkIjoiaXBtZy1saTdjamMxbSJ9]

Apply complete! Resources: 4 added, 0 changed, 0 destroyed.

```

double apply

```
 terraform apply
2020/12/07 19:27:12 [WARN] Log levels other than TRACE are currently unreliable, and are supported only for backward compatibility.
  Use TF_LOG=TRACE to see Terraform's internal logs.
  ----
tencentcloud_address_template.templateB: Refreshing state... [id=ipm-27p5xxzw]
tencentcloud_protocol_template.templateB: Refreshing state... [id=ppm-iqt4ksyi]
tencentcloud_security_group.foo: Refreshing state... [id=sg-6l84uld5]
tencentcloud_address_template_group.group: Refreshing state... [id=ipmg-li7cjc1m]
tencentcloud_protocol_template_group.group: Refreshing state... [id=ppmg-bmdguwfw]
tencentcloud_security_group_rule.address_template_group: Refreshing state... [id=eyJzZ19pZCI6InNnLTZsODR1bGQ1IiwicG9saWN5X3R5cGUiOiJpbmdyZXNzIiwiY2lkcl9pcCI6IiIsInByb3RvY29sIjoiQUxMIiwicG9ydF9yYW5nZSI6IkFMTCIsImFjdGlvbiI6IkRST1AiLCJzb3VyY2Vfc2dfaWQiOiIiLCJkZXNjcmlwdGlvbiI6IiIsImFkZHJlc3NfdGVtcGxhdGVfaWQiOiIiLCJhZGRyZXNzX3RlbXBsYXRlX2dyb3VwX2lkIjoiaXBtZy1saTdjamMxbSJ9]
tencentcloud_security_group_rule.protocol_template_group: Refreshing state... [id=eyJzZ19pZCI6InNnLTZsODR1bGQ1IiwicG9saWN5X3R5cGUiOiJpbmdyZXNzIiwiY2lkcl9pcCI6IjAuMC4wLjAvMCIsInByb3RvY29sIjoiQUxMIiwicG9ydF9yYW5nZSI6IkFMTCIsImFjdGlvbiI6IkRST1AiLCJzb3VyY2Vfc2dfaWQiOiIiLCJkZXNjcmlwdGlvbiI6IiIsInByb3RvY29sX3RlbXBsYXRlX2lkIjoiIiwicHJvdG9jb2xfdGVtcGxhdGVfZ3JvdXBfaWQiOiJwcG1nLWJtZGd1d2Z3In0=]
tencentcloud_security_group_rule.address_template: Refreshing state... [id=eyJzZ19pZCI6InNnLTZsODR1bGQ1IiwicG9saWN5X3R5cGUiOiJJTkdSRVNTIiwiY2lkcl9pcCI6IiIsInByb3RvY29sIjoiQUxMIiwicG9ydF9yYW5nZSI6IkFMTCIsImFjdGlvbiI6IkRST1AiLCJzb3VyY2Vfc2dfaWQiOiIiLCJkZXNjcmlwdGlvbiI6IiIsImFkZHJlc3NfdGVtcGxhdGVfaWQiOiJpcG0tMjdwNXh4enciLCJhZGRyZXNzX3RlbXBsYXRlX2dyb3VwX2lkIjoiIn0=]
tencentcloud_security_group_rule.protocol_template: Refreshing state... [id=eyJzZ19pZCI6InNnLTZsODR1bGQ1IiwicG9saWN5X3R5cGUiOiJJTkdSRVNTIiwiY2lkcl9pcCI6IjAuMC4wLjAvMCIsInByb3RvY29sIjoiQUxMIiwicG9ydF9yYW5nZSI6IkFMTCIsImFjdGlvbiI6IkRST1AiLCJzb3VyY2Vfc2dfaWQiOiIiLCJkZXNjcmlwdGlvbiI6IiIsInByb3RvY29sX3RlbXBsYXRlX2lkIjoicHBtLWlxdDRrc3lpIiwicHJvdG9jb2xfdGVtcGxhdGVfZ3JvdXBfaWQiOiIifQ==]

Apply complete! Resources: 0 added, 0 changed, 0 destroyed.

```


destroy
```
terraform destroy
2020/12/07 19:27:27 [WARN] Log levels other than TRACE are currently unreliable, and are supported only for backward compatibility.
  Use TF_LOG=TRACE to see Terraform's internal logs.
  ----
tencentcloud_protocol_template.templateB: Refreshing state... [id=ppm-iqt4ksyi]
tencentcloud_security_group.foo: Refreshing state... [id=sg-6l84uld5]
tencentcloud_address_template.templateB: Refreshing state... [id=ipm-27p5xxzw]
tencentcloud_protocol_template_group.group: Refreshing state... [id=ppmg-bmdguwfw]
tencentcloud_address_template_group.group: Refreshing state... [id=ipmg-li7cjc1m]
tencentcloud_security_group_rule.address_template: Refreshing state... [id=eyJzZ19pZCI6InNnLTZsODR1bGQ1IiwicG9saWN5X3R5cGUiOiJJTkdSRVNTIiwiY2lkcl9pcCI6IiIsInByb3RvY29sIjoiQUxMIiwicG9ydF9yYW5nZSI6IkFMTCIsImFjdGlvbiI6IkRST1AiLCJzb3VyY2Vfc2dfaWQiOiIiLCJkZXNjcmlwdGlvbiI6IiIsImFkZHJlc3NfdGVtcGxhdGVfaWQiOiJpcG0tMjdwNXh4enciLCJhZGRyZXNzX3RlbXBsYXRlX2dyb3VwX2lkIjoiIn0=]
tencentcloud_security_group_rule.protocol_template_group: Refreshing state... [id=eyJzZ19pZCI6InNnLTZsODR1bGQ1IiwicG9saWN5X3R5cGUiOiJpbmdyZXNzIiwiY2lkcl9pcCI6IjAuMC4wLjAvMCIsInByb3RvY29sIjoiQUxMIiwicG9ydF9yYW5nZSI6IkFMTCIsImFjdGlvbiI6IkRST1AiLCJzb3VyY2Vfc2dfaWQiOiIiLCJkZXNjcmlwdGlvbiI6IiIsInByb3RvY29sX3RlbXBsYXRlX2lkIjoiIiwicHJvdG9jb2xfdGVtcGxhdGVfZ3JvdXBfaWQiOiJwcG1nLWJtZGd1d2Z3In0=]
tencentcloud_security_group_rule.protocol_template: Refreshing state... [id=eyJzZ19pZCI6InNnLTZsODR1bGQ1IiwicG9saWN5X3R5cGUiOiJJTkdSRVNTIiwiY2lkcl9pcCI6IjAuMC4wLjAvMCIsInByb3RvY29sIjoiQUxMIiwicG9ydF9yYW5nZSI6IkFMTCIsImFjdGlvbiI6IkRST1AiLCJzb3VyY2Vfc2dfaWQiOiIiLCJkZXNjcmlwdGlvbiI6IiIsInByb3RvY29sX3RlbXBsYXRlX2lkIjoicHBtLWlxdDRrc3lpIiwicHJvdG9jb2xfdGVtcGxhdGVfZ3JvdXBfaWQiOiIifQ==]
tencentcloud_security_group_rule.address_template_group: Refreshing state... [id=eyJzZ19pZCI6InNnLTZsODR1bGQ1IiwicG9saWN5X3R5cGUiOiJpbmdyZXNzIiwiY2lkcl9pcCI6IiIsInByb3RvY29sIjoiQUxMIiwicG9ydF9yYW5nZSI6IkFMTCIsImFjdGlvbiI6IkRST1AiLCJzb3VyY2Vfc2dfaWQiOiIiLCJkZXNjcmlwdGlvbiI6IiIsImFkZHJlc3NfdGVtcGxhdGVfaWQiOiIiLCJhZGRyZXNzX3RlbXBsYXRlX2dyb3VwX2lkIjoiaXBtZy1saTdjamMxbSJ9]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  - destroy

Terraform will perform the following actions:

  # tencentcloud_address_template.templateB will be destroyed
  - resource "tencentcloud_address_template" "templateB" {
      - addresses = [
          - "1.1.1.0-1.1.1.1",
          - "1.1.1.1/24",
        ] -> null
      - id        = "ipm-27p5xxzw" -> null
      - name      = "testB" -> null
    }

  # tencentcloud_address_template_group.group will be destroyed
  - resource "tencentcloud_address_template_group" "group" {
      - id           = "ipmg-li7cjc1m" -> null
      - name         = "test_update" -> null
      - template_ids = [
          - "ipm-27p5xxzw",
        ] -> null
    }

  # tencentcloud_protocol_template.templateB will be destroyed
  - resource "tencentcloud_protocol_template" "templateB" {
      - id        = "ppm-iqt4ksyi" -> null
      - name      = "testB" -> null
      - protocols = [
          - "tcp:80",
          - "udp:90,111",
        ] -> null
    }

  # tencentcloud_protocol_template_group.group will be destroyed
  - resource "tencentcloud_protocol_template_group" "group" {
      - id           = "ppmg-bmdguwfw" -> null
      - name         = "test_update" -> null
      - template_ids = [
          - "ppm-iqt4ksyi",
        ] -> null
    }

  # tencentcloud_security_group.foo will be destroyed
  - resource "tencentcloud_security_group" "foo" {
      - description = "ci-temp-test-sg" -> null
      - id          = "sg-6l84uld5" -> null
      - name        = "ci-temp-test-sg" -> null
      - project_id  = 0 -> null
      - tags        = {} -> null
    }

  # tencentcloud_security_group_rule.address_template will be destroyed
  - resource "tencentcloud_security_group_rule" "address_template" {
      - id                = "eyJzZ19pZCI6InNnLTZsODR1bGQ1IiwicG9saWN5X3R5cGUiOiJJTkdSRVNTIiwiY2lkcl9pcCI6IiIsInByb3RvY29sIjoiQUxMIiwicG9ydF9yYW5nZSI6IkFMTCIsImFjdGlvbiI6IkRST1AiLCJzb3VyY2Vfc2dfaWQiOiIiLCJkZXNjcmlwdGlvbiI6IiIsImFkZHJlc3NfdGVtcGxhdGVfaWQiOiJpcG0tMjdwNXh4enciLCJhZGRyZXNzX3RlbXBsYXRlX2dyb3VwX2lkIjoiIn0=" -> null
      - ip_protocol       = "ALL" -> null
      - policy            = "DROP" -> null
      - port_range        = "ALL" -> null
      - security_group_id = "sg-6l84uld5" -> null
      - type              = "INGRESS" -> null

      - address_template {
          - template_id = "ipm-27p5xxzw" -> null
        }
    }

  # tencentcloud_security_group_rule.address_template_group will be destroyed
  - resource "tencentcloud_security_group_rule" "address_template_group" {
      - id                = "eyJzZ19pZCI6InNnLTZsODR1bGQ1IiwicG9saWN5X3R5cGUiOiJpbmdyZXNzIiwiY2lkcl9pcCI6IiIsInByb3RvY29sIjoiQUxMIiwicG9ydF9yYW5nZSI6IkFMTCIsImFjdGlvbiI6IkRST1AiLCJzb3VyY2Vfc2dfaWQiOiIiLCJkZXNjcmlwdGlvbiI6IiIsImFkZHJlc3NfdGVtcGxhdGVfaWQiOiIiLCJhZGRyZXNzX3RlbXBsYXRlX2dyb3VwX2lkIjoiaXBtZy1saTdjamMxbSJ9" -> null
      - ip_protocol       = "ALL" -> null
      - policy            = "DROP" -> null
      - port_range        = "ALL" -> null
      - security_group_id = "sg-6l84uld5" -> null
      - type              = "ingress" -> null

      - address_template {
          - group_id = "ipmg-li7cjc1m" -> null
        }
    }

  # tencentcloud_security_group_rule.protocol_template will be destroyed
  - resource "tencentcloud_security_group_rule" "protocol_template" {
      - cidr_ip           = "0.0.0.0/0" -> null
      - id                = "eyJzZ19pZCI6InNnLTZsODR1bGQ1IiwicG9saWN5X3R5cGUiOiJJTkdSRVNTIiwiY2lkcl9pcCI6IjAuMC4wLjAvMCIsInByb3RvY29sIjoiQUxMIiwicG9ydF9yYW5nZSI6IkFMTCIsImFjdGlvbiI6IkRST1AiLCJzb3VyY2Vfc2dfaWQiOiIiLCJkZXNjcmlwdGlvbiI6IiIsInByb3RvY29sX3RlbXBsYXRlX2lkIjoicHBtLWlxdDRrc3lpIiwicHJvdG9jb2xfdGVtcGxhdGVfZ3JvdXBfaWQiOiIifQ==" -> null
      - policy            = "DROP" -> null
      - security_group_id = "sg-6l84uld5" -> null
      - type              = "INGRESS" -> null

      - protocol_template {
          - template_id = "ppm-iqt4ksyi" -> null
        }
    }

  # tencentcloud_security_group_rule.protocol_template_group will be destroyed
  - resource "tencentcloud_security_group_rule" "protocol_template_group" {
      - cidr_ip           = "0.0.0.0/0" -> null
      - id                = "eyJzZ19pZCI6InNnLTZsODR1bGQ1IiwicG9saWN5X3R5cGUiOiJpbmdyZXNzIiwiY2lkcl9pcCI6IjAuMC4wLjAvMCIsInByb3RvY29sIjoiQUxMIiwicG9ydF9yYW5nZSI6IkFMTCIsImFjdGlvbiI6IkRST1AiLCJzb3VyY2Vfc2dfaWQiOiIiLCJkZXNjcmlwdGlvbiI6IiIsInByb3RvY29sX3RlbXBsYXRlX2lkIjoiIiwicHJvdG9jb2xfdGVtcGxhdGVfZ3JvdXBfaWQiOiJwcG1nLWJtZGd1d2Z3In0=" -> null
      - policy            = "DROP" -> null
      - security_group_id = "sg-6l84uld5" -> null
      - type              = "ingress" -> null

      - protocol_template {
          - group_id = "ppmg-bmdguwfw" -> null
        }
    }

Plan: 0 to add, 0 to change, 9 to destroy.

Do you really want to destroy all resources?
  Terraform will destroy all your managed infrastructure, as shown above.
  There is no undo. Only 'yes' will be accepted to confirm.

  Enter a value: yes

tencentcloud_security_group_rule.protocol_template_group: Destroying... [id=eyJzZ19pZCI6InNnLTZsODR1bGQ1IiwicG9saWN5X3R5cGUiOiJpbmdyZXNzIiwiY2lkcl9pcCI6IjAuMC4wLjAvMCIsInByb3RvY29sIjoiQUxMIiwicG9ydF9yYW5nZSI6IkFMTCIsImFjdGlvbiI6IkRST1AiLCJzb3VyY2Vfc2dfaWQiOiIiLCJkZXNjcmlwdGlvbiI6IiIsInByb3RvY29sX3RlbXBsYXRlX2lkIjoiIiwicHJvdG9jb2xfdGVtcGxhdGVfZ3JvdXBfaWQiOiJwcG1nLWJtZGd1d2Z3In0=]
tencentcloud_security_group_rule.protocol_template: Destroying... [id=eyJzZ19pZCI6InNnLTZsODR1bGQ1IiwicG9saWN5X3R5cGUiOiJJTkdSRVNTIiwiY2lkcl9pcCI6IjAuMC4wLjAvMCIsInByb3RvY29sIjoiQUxMIiwicG9ydF9yYW5nZSI6IkFMTCIsImFjdGlvbiI6IkRST1AiLCJzb3VyY2Vfc2dfaWQiOiIiLCJkZXNjcmlwdGlvbiI6IiIsInByb3RvY29sX3RlbXBsYXRlX2lkIjoicHBtLWlxdDRrc3lpIiwicHJvdG9jb2xfdGVtcGxhdGVfZ3JvdXBfaWQiOiIifQ==]
tencentcloud_security_group_rule.address_template: Destroying... [id=eyJzZ19pZCI6InNnLTZsODR1bGQ1IiwicG9saWN5X3R5cGUiOiJJTkdSRVNTIiwiY2lkcl9pcCI6IiIsInByb3RvY29sIjoiQUxMIiwicG9ydF9yYW5nZSI6IkFMTCIsImFjdGlvbiI6IkRST1AiLCJzb3VyY2Vfc2dfaWQiOiIiLCJkZXNjcmlwdGlvbiI6IiIsImFkZHJlc3NfdGVtcGxhdGVfaWQiOiJpcG0tMjdwNXh4enciLCJhZGRyZXNzX3RlbXBsYXRlX2dyb3VwX2lkIjoiIn0=]
tencentcloud_security_group_rule.address_template_group: Destroying... [id=eyJzZ19pZCI6InNnLTZsODR1bGQ1IiwicG9saWN5X3R5cGUiOiJpbmdyZXNzIiwiY2lkcl9pcCI6IiIsInByb3RvY29sIjoiQUxMIiwicG9ydF9yYW5nZSI6IkFMTCIsImFjdGlvbiI6IkRST1AiLCJzb3VyY2Vfc2dfaWQiOiIiLCJkZXNjcmlwdGlvbiI6IiIsImFkZHJlc3NfdGVtcGxhdGVfaWQiOiIiLCJhZGRyZXNzX3RlbXBsYXRlX2dyb3VwX2lkIjoiaXBtZy1saTdjamMxbSJ9]
tencentcloud_security_group_rule.address_template: Destruction complete after 0s
tencentcloud_security_group_rule.address_template_group: Destruction complete after 0s
tencentcloud_security_group_rule.protocol_template: Destruction complete after 0s
tencentcloud_security_group_rule.protocol_template_group: Destruction complete after 0s
tencentcloud_address_template_group.group: Destroying... [id=ipmg-li7cjc1m]
tencentcloud_protocol_template_group.group: Destroying... [id=ppmg-bmdguwfw]
tencentcloud_security_group.foo: Destroying... [id=sg-6l84uld5]
tencentcloud_security_group.foo: Destruction complete after 1s
tencentcloud_address_template_group.group: Destruction complete after 1s
tencentcloud_address_template.templateB: Destroying... [id=ipm-27p5xxzw]
tencentcloud_protocol_template_group.group: Destruction complete after 2s
tencentcloud_protocol_template.templateB: Destroying... [id=ppm-iqt4ksyi]
tencentcloud_address_template.templateB: Destruction complete after 2s
tencentcloud_protocol_template.templateB: Destruction complete after 1s

Destroy complete! Resources: 9 destroyed.

```




old version state in new version provider

apply
```
terraform apply
2020/12/07 19:34:16 [WARN] Log levels other than TRACE are currently unreliable, and are supported only for backward compatibility.
  Use TF_LOG=TRACE to see Terraform's internal logs.
  ----
tencentcloud_security_group.foo: Refreshing state... [id=sg-r8d86gxb]
tencentcloud_security_group_rule.egress-drop: Refreshing state... [id=eyJzZ19pZCI6InNnLXI4ZDg2Z3hiIiwicG9saWN5X3R5cGUiOiJpbmdyZXNzIiwiY2lkcl9pcCI6IjAuMC4wLjAvMCIsInByb3RvY29sIjoiQUxMIiwicG9ydF9yYW5nZSI6IkFMTCIsImFjdGlvbiI6IkRST1AiLCJzb3VyY2Vfc2dfaWQiOiIiLCJkZXNjcmlwdGlvbiI6IiJ9]

Apply complete! Resources: 0 added, 0 changed, 0 destroyed.
```